{
    "introduction": {
        "story": "Parce que j'ai utilisé quasiment exclusivement des ressources Open-Source, c'est important de reconnaître que j'apprécie énormément le travail des personnes qui les ont mises à disposition et qui m'ont permis créer ce site web.",
        "thanks": "Alors je les remercie ici-même !"
    },
    "typography" : {
        "displayName": "Typographie",
        "introduction": "La contrainte : utiliser uniquement des familles variables, ça permet de charger moins de fichiers de polices en une fois. Ce n'était franchement pas facile de les trouver, et de les appairer.",
        "serif": {
            "name": "Fraunces",
            "story": [
                "Il s'agit d'une famille de police Serif dont je suis tombée amoureuse depuis un moment déjà. J'avais déjà créé une première version de mon site web avec celle-ci. Je l'ai aussi utilisée dans un projet scolaire qui consistait à créer un site web personnel.",
                "Elle a plusieurs facettes et parmi celles-cis, il y a soit celles où elle peut être aussi sérieuse et stricte comme une didone (Bodoni), et dans les autres il y en une où elle est aussi plus ronde et rigolote comme une mécane moderne (Cooper Gothic). Je trouve qu'elle représente vraiment ma personnalité, en somme.",
                "Cette (super)famille de police a été conçue par Phaedra Charles (qui gère Undercase Type) et Flavia Zimbardi."
            ]
        },
        "sans": {
            "name": "Epilogue",
            "story": [
                "Mon amour pour les \"Grotesques\" me perdra un jour. Je ne suis jamais parvenue à utiliser une sans-serif qui ne soit pas de ce type de fonte.",
                "Autrement, Epilogue est une famille dessinée en 2018 par Tyler Finck avec la fonderie Etcetera Type. D'ailleurs, je pourrais  potentiellement utiliser sur mon site une famille \"Mono\" qu'il a dessinée. Mais ça, seulement à partir du jour où je déciderais de partager du code ou ce qui nécessiterait ce genre d'affichage."
            ]
        }
    }
}